[
    {
        "id": 1,
        "title": "Finding the Perfect Home Rent in Dhaka",
        "summary": "Tips for finding budget-friendly rental homes in the city.",
        "image": "https://images.pexels.com/photos/667838/pexels-photo-667838.jpeg",
        "date": "2025-06-25",
        "slug": "perfect-home-rent-dhaka",
        "description": "Searching for a rental home in Dhaka can be overwhelming. This blog provides tips on choosing the right location, checking amenities, and budgeting rent, especially for students and young professionals."
    },
    {
        "id": 2,
        "title": "How to Sublet Your Room Without Legal Trouble",
        "summary": "A step-by-step guide to subletting your room responsibly.",
        "image": "https://images.pexels.com/photos/1457842/pexels-photo-1457842.jpeg",
        "date": "2025-06-22",
        "slug": "sublet-room-guide",
        "description": "Subletting can be a lifesaver when leaving temporarily. Learn how to notify your landlord, screen tenants, and set up agreements that protect both parties."
    },
    {
        "id": 3,
        "title": "Living Alone as a Student: Pros and Cons",
        "summary": "Is solo living right for you? Here's what to consider.",
        "image": "https://images.pexels.com/photos/259962/pexels-photo-259962.jpeg",
        "date": "2025-06-20",
        "slug": "student-solo-life",
        "description": "Living alone as a student brings independence and peace but can be lonely and expensive. This post explores emotional and financial aspects of solo living."
    },
    {
        "id": 4,
        "title": "Boys Hostel vs. Shared Apartment",
        "summary": "Compare living in a hostel with sharing a flat with roommates.",
        "image": "https://images.pexels.com/photos/245208/pexels-photo-245208.jpeg",
        "date": "2025-06-18",
        "slug": "boys-hostel-vs-apartment",
        "description": "Which is better: a boys' hostel or a shared apartment? We compare cleanliness, freedom, rent, and lifestyle factors to help you decide."
    },
    {
        "id": 5,
        "title": "Affordable Sublet Deals for Girls in Uttara",
        "summary": "Explore verified sublet listings for girls in Uttara area.",
        "image": "https://images.pexels.com/photos/6670868/pexels-photo-6670868.jpeg",
        "date": "2025-06-15",
        "slug": "girls-sublet-uttara",
        "description": "Girls looking for safe and affordable sublets in Uttara will benefit from this curated list with contact info, pricing, and neighborhood guides."
    },
    {
        "id": 6,
        "title": "What to Check Before Signing a Rent Agreement",
        "summary": "Legal and practical tips before committing to a rental contract.",
        "image": "https://images.pexels.com/photos/5502253/pexels-photo-5502253.jpeg",
        "date": "2025-06-12",
        "slug": "check-before-signing-rent",
        "description": "Never rush into signing rental documents. Learn what clauses to review, how to negotiate rent, and the red flags in rental agreements."
    },
    {
        "id": 7,
        "title": "Safe Neighborhoods for Single Women in Dhaka",
        "summary": "Best places in Dhaka for women living alone or with roommates.",
        "image": "https://images.pexels.com/photos/6908568/pexels-photo-6908568.jpeg",
        "date": "2025-06-10",
        "slug": "safe-areas-single-women",
        "description": "From Dhanmondi to Bashundhara, this post lists secure, women-friendly areas in Dhaka with access to transport, groceries, and emergency help."
    },
    {
        "id": 8,
        "title": "Daily Life in a Shared Boys Apartment",
        "summary": "A funny yet honest look at shared living among bachelors.",
        "image": "https://images.pexels.com/photos/7697210/pexels-photo-7697210.jpeg",
        "date": "2025-06-08",
        "slug": "shared-boys-apartment-life",
        "description": "From kitchen wars to noisy football nights, here's what to expect when living with other boys in a rented flat. A mix of fun, frustration, and friendship."
    },
    {
        "id": 9,
        "title": "Sublet vs. Flat Share: Which One Is Cheaper?",
        "summary": "Understand cost differences between sublets and flat sharing.",
        "image": "https://images.pexels.com/photos/6933764/pexels-photo-6933764.jpeg",
        "date": "2025-06-06",
        "slug": "sublet-vs-flatshare",
        "description": "This blog breaks down rent, utility bills, and privacy when deciding between a sublet or splitting a flat with roommates."
    },
    {
        "id": 10,
        "title": "How to Find Verified Sublets Online",
        "summary": "Avoid scams with these trusted websites and pages.",
        "image": "https://images.pexels.com/photos/31603700/pexels-photo-31603700.jpeg",
        "date": "2025-06-04",
        "slug": "find-verified-sublets",
        "description": "With so many fake listings, it's hard to find safe sublets online. This guide lists top platforms and tips to verify landlords before you pay anything."
    },
    {
        "id": 11,
        "title": "Decorating a Rented Room on a Budget",
        "summary": "Low-cost decor ideas to make your rental room feel like home.",
        "image": "https://images.pexels.com/photos/11002390/pexels-photo-11002390.jpeg",
        "date": "2025-06-02",
        "slug": "rented-room-decor-ideas",
        "description": "Rented doesn't have to be boring. Use lights, fabric, and removable items to style your space without losing your security deposit."
    },
    {
        "id": 12,
        "title": "5 Signs You Found a Great Landlord",
        "summary": "What makes a landlord reliable and helpful?",
        "image": "https://images.pexels.com/photos/8436826/pexels-photo-8436826.jpeg",
        "date": "2025-05-30",
        "slug": "great-landlord-signs",
        "description": "Good landlords are gold. They fix issues fast, respect privacy, and keep the place safe. See how to spot the good ones before signing anything."
    },
    {
        "id": 13,
        "title": "Girls Sharing a Flat: Rules That Work",
        "summary": "How to avoid drama when multiple girls live together.",
        "image": "https://images.pexels.com/photos/12666339/pexels-photo-12666339.jpeg",
        "date": "2025-05-28",
        "slug": "girls-sharing-flat",
        "description": "Want peaceful co-living? Establish these roommate rules on cleaning, guests, food, and payments to avoid unnecessary conflicts."
    },
    {
        "id": 14,
        "title": "Top 5 Facebook Groups for Sublet Deals in BD",
        "summary": "Join these active groups to get daily sublet offers.",
        "image": "https://images.pexels.com/photos/14840760/pexels-photo-14840760.jpeg",
        "date": "2025-05-25",
        "slug": "top-facebook-sublet-groups",
        "description": "Looking for sublets? These Facebook groups offer regular listings for boys, girls, bachelors, and families—updated hourly with photos."
    },
    {
        "id": 15,
        "title": "Essential Items for Your First Rented Room",
        "summary": "Checklist for moving into your first rental space.",
        "image": "https://images.pexels.com/photos/11720367/pexels-photo-11720367.jpeg",
        "date": "2025-05-22",
        "slug": "first-rented-room-checklist",
        "description": "Don’t forget the basics! This checklist includes bedding, utensils, safety tools, and appliances every renter should have from day one."
    }
]